мояработа/src/Documents/РеализацияТоваров/РеализацияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваров</name>
  <basedOn>Document.ПоступлениеТоваров</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

мояработа/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

мояработа/src/Documents/РеализацияТоваров/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	// регистр ОстаткиТоваров
	Перем ДанныеЗаполнения;
	Перем Запрос;
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

   Движения.Записать();
   
   Если Режим = РежимПроведенияДокумента.Оперативный Тогда
   
   Запрос = Новый Запрос;
  	Запрос.Текст =
  	"ВЫБРАТЬ
  	|	ОстаткиТоваровОстатки.Номенклатура,
  	|	ОстаткиТоваровОстатки.КоличествоОстаток КАК Количество
  	|ИЗ
  	|	РегистрНакопления.ОстаткиТоваров.Остатки(, Номенклатура В
  	|		(ВЫБРАТЬ
  	|			РеализацияТоваровТовары.Номенклатура
  	|		ИЗ
  	|			Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
  	|		ГДЕ
  	|			РеализацияТоваровТовары.Ссылка = &Ссылка)) КАК ОстаткиТоваровОстатки
  	|ГДЕ
  	|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
  
  Запрос.УстановитьПараметр("Ссылка", Ссылка);
  
  РезультатЗапроса = Запрос.Выполнить();
  
  ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
  
  Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
  	Сообщить("По номенклатуре "+ВыборкаДетальныеЗаписи.Номенклатура+" остаток "+ВыборкаДетальныеЗаписи.Количество);
  КонецЦикла;
  
  КонецЕсли;
   
   Если Отказ Тогда
   	Возврат;
   КонецЕсли;
   
   
   Запрос = Новый Запрос;
   Запрос.Текст =
   	"ВЫБРАТЬ
   	|	ОстаткиТоваровОстатки.Номенклатура,
   	|	ОстаткиТоваровОстатки.КоличествоОстаток КАК Количество,
   	|	ОстаткиТоваровОстатки.СуммаОстаток КАК Сумма
   	|ИЗ
   	|	РегистрНакопления.ОстаткиТоваров.Остатки(&МоментВремени, Номенклатура В
   	|		(ВЫБРАТЬ
   	|			РеализацияТоваровТовары.Номенклатура
   	|		ИЗ
   	|			Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
   	|		ГДЕ
   	|			РеализацияТоваровТовары.Ссылка = &Ссылка)) КАК ОстаткиТоваровОстатки";
   
   Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
   Запрос.УстановитьПараметр("Ссылка", Ссылка);
   
   РезультатЗапроса = Запрос.Выполнить();
   
   ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
   
   Движения.ОстаткиТоваров.Записывать = Истина;
   
   Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
   	
   	Для Каждого Движение Из Движения.ОстаткиТоваров Цикл
   		
   		Если Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура Тогда
   			Движение.Сумма = Движение.Количество * ВыборкаДетальныеЗаписи.Сумма/ВыборкаДетальныеЗаписи.Количество;
   	КонецЕсли;
   	КонецЦикла;
   	КонецЦикла;
   


	//@skip-warning
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Контрагент;
		Ответственный = ДанныеЗаполнения.Ответственный;

		Для Каждого ТекСтрокаТовары из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
		КонецЦикла;
	КонецЕсли;

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Товары.Итог("Сумма")
КонецПроцедуры
